amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
  if (is_in)
  {
    if (index < AUDIO_IN_NUMBER)
    {
      return &usb_audio_endpoint_in_data[index];
    }
  }
  else
  {
    if (index < AUDIO_OUT_NUMBER)
    {
      return &usb_audio_endpoint_out_data[index];
    }
  }

  return NULL;
}

USBD_AUDIO_LoopbackDataTypeDef *USBD_AUDIO_getDataFromUnitId(USBD_AUDIO_HandleTypeDef *haudio, uint8_t unitId)
{
  if (unitId < 1 || haudio == NULL)
    return NULL;

  uint32_t index = (unitId - 1) / AUDIO_UNIT_ID_PER_ENDPOINT / 2;
  uint32_t is_in = (((unitId - 1) / AUDIO_UNIT_ID_PER_ENDPOINT) % 2) == 1;

  if (is_in)
  {
    if (index < AUDIO_IN_NUMBER)
    {
      return &usb_audio_endpoint_in_data[index];
    }
  }
  else
  {
    if (index < AUDIO_OUT_NUMBER)
    {
      return &usb_audio_endpoint_out_data[index];
    }
  }
  return NULL;
}

/** @defgroup USBD_AUDIO_Private_Functions
  * @{
  */

/**
  * @brief  USBD_AUDIO_Init
  *         Initialize the AUDIO interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
USBD_AUDIO_LoopbackDataTypeDef usb_audio_endpoint_out_data[AUDIO_OUT_NUMBER];
USBD_AUDIO_LoopbackDataTypeDef usb_audio_endpoint_in_data[AUDIO_IN_NUMBER];
static uint16_t usb_audio_notify_unit_id_change;
static uint16_t usb_audio_notify_in_progress_data;

volatile uint8_t usb_new_frame_flag;
static volatile uint32_t *SCB_DEMCR = (volatile uint32_t *)0xE000EDFC;  //address of the register

static uint8_t USBD_AUDIO_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  UNUSED(cfgidx);
  static USBD_AUDIO_HandleTypeDef haudioData;
  USBD_AUDIO_HandleTypeDef *haudio;

  /* Allocate Audio structure */
  haudio = &haudioData;

  if (haudio == NULL)
  {
    pdev->pClassDataCmsit[pdev->classId] = NULL;
    return (uint8_t)USBD_EMEM;
  }

  pdev->pClassDataCmsit[pdev->classId] = (void *)haudio;

  *SCB_DEMCR = *SCB_DEMCR | 0x01000000;
  DWT->CYCCNT = 0;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;


#ifdef USE_USBD_COMPOSITE
  /* Get the Endpoints addresses allocated for this class instance */
  AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t)pdev->classId);
#endif /* USE_USBD_COMPOSITE */

  for (size_t i = 0; i < AUDIO_OUT_NUMBER; i++)
  {
    unsigned int ep = AUDIO_OUT_EP + i * 2;
    unsigned int ep_feedback = AUDIO_OUT_FEEDBACK_EP + i * 2;
    USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_out_data[i];
    data->is_in = 0;
    data->endpoint = ep;
    data->endpoint_feedback = ep_feedback;
    data->max_packet_size = AUDIO_OUT_MAX_PACKET;
    data->nominal_packet_size = AUDIO_OUT_PACKET;
    data->index = i;
    data->current_alternate = 0U;
    data->next_target_frame = -1;
    data->next_target_frame_feedback = -1;
    data->transfer_in_progress = 0;
    memset(&data->buffer, 0, sizeof(data->buffer));

    if (pdev->dev_speed == USBD_SPEED_HIGH)
    {
      pdev->ep_out[ep & 0xFU].bInterval = AUDIO_HS_BINTERVAL;
    }
    else /* LOW and FULL-speed endpoints */
    {
      pdev->ep_out[ep & 0xFU].bInterval = AUDIO_FS_BINTERVAL;
    }

    /* Open EP OUT */
    (void)USBD_LL_OpenEP(pdev, ep, USBD_EP_TYPE_ISOC, data->max_packet_size);
    pdev->ep_out[ep & 0xFU].is_used = 1U;

    if (pdev->dev_speed == USBD_SPEED_HIGH)
    {
      pdev->ep_in[ep_feedback & 0xFU].bInterval = AUDIO_HS_BINTERVAL;
    }
    else /* LOW and FULL-speed endpoints */
    {
      pdev->ep_in[ep_feedback & 0xFU].bInterval = AUDIO_FS_BINTERVAL;
    }

    /* Open EP OUT */
    (void)USBD_LL_OpenEP(pdev, ep_feedback, USBD_EP_TYPE_ISOC, AUDIO_OUT_FEEDBACK_MAX_PACKET);
    pdev->ep_in[ep_feedback & 0xFU].is_used = 1U;
  }


  for (size_t i = 0; i < AUDIO_IN_NUMBER; i++)
  {
    unsigned int ep = AUDIO_IN_EP + i * 2;
    USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_in_data[i];
    data->is_in = 1;
    data->endpoint = ep;
    data->max_packet_size = AUDIO_OUT_MAX_PACKET;
    data->nominal_packet_size = AUDIO_OUT_PACKET;
    data->index = i;
    data->current_alternate = 0U;
    data->next_target_frame = -1;
    data->transfer_in_progress = 0;
    memset(&data->buffer, 0, sizeof(data->buffer));

    /* Open EP IN */
    if (pdev->dev_speed == USBD_SPEED_HIGH)
    {
      pdev->ep_in[ep & 0xFU].bInterval = AUDIO_HS_BINTERVAL;
    }
    else /* LOW and FULL-speed endpoints */
    {
      pdev->ep_in[ep & 0xFU].bInterval = AUDIO_FS_BINTERVAL;
    }

    /* Open EP OUT */
    (void)USBD_LL_OpenEP(pdev, ep, USBD_EP_TYPE_ISOC, data->max_packet_size);
    pdev->ep_in[ep & 0xFU].is_used = 1U;
  }

  {
    uint8_t ep = AUDIO_INTERRUPT_EP;
    /* Open EP IN for control status interrupt */
    if (pdev->dev_speed == USBD_SPEED_HIGH)
    {
      pdev->ep_in[ep & 0xFU].bInterval = AUDIO_HS_BINTERVAL;
    }
    else /* LOW and FULL-speed endpoints */
    {
      pdev->ep_in[ep & 0xFU].bInterval = AUDIO_FS_BINTERVAL;
    }

    /* Open EP OUT */
    (void)USBD_LL_OpenEP(pdev, ep, USBD_EP_TYPE_INTR, 2);
    pdev->ep_in[ep & 0xFU].is_used = 1U;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_Init
  *         DeInitialize the AUDIO layer
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t USBD_AUDIO_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  UNUSED(cfgidx);

#ifdef USE_USBD_COMPOSITE
  /* Get the Endpoints addresses allocated for this class instance */
  AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t)pdev->classId);
#endif /* USE_USBD_COMPOSITE */


  /* DeInit  physical Interface components */
  if (pdev->pClassDataCmsit[pdev->classId] != NULL)
  {
    for (size_t i = 0; i < AUDIO_IN_NUMBER; i++)
    {
      /* Close EP IN */
      USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_in_data[i];
      (void)USBD_LL_CloseEP(pdev, data->endpoint);
      pdev->ep_out[data->endpoint & 0xFU].is_used = 0U;
      pdev->ep_out[data->endpoint & 0xFU].bInterval = 0U;
    }

    for (size_t i = 0; i < AUDIO_OUT_NUMBER; i++)
    {
      /* Close EP OUT */
      USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_out_data[i];
      (void)USBD_LL_CloseEP(pdev, data->endpoint);
      pdev->ep_out[data->endpoint & 0xFU].is_used = 0U;
      pdev->ep_out[data->endpoint & 0xFU].bInterval = 0U;
      /* Close EP OUT feedback */
      (void)USBD_LL_CloseEP(pdev, data->endpoint_feedback);
      pdev->ep_out[data->endpoint_feedback & 0xFU].is_used = 0U;
      pdev->ep_out[data->endpoint_feedback & 0xFU].bInterval = 0U;
    }

    (void)USBD_LL_CloseEP(pdev, AUDIO_INTERRUPT_EP);
    pdev->ep_out[AUDIO_INTERRUPT_EP & 0xFU].is_used = 0U;
    pdev->ep_out[AUDIO_INTERRUPT_EP & 0xFU].bInterval = 0U;

    //(void)USBD_free(pdev->pClassDataCmsit[pdev->classId]);
    pdev->pClassDataCmsit[pdev->classId] = NULL;
  }

  return (uint8_t)USBD_OK;
}

