amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
static void USBD_EnableOutTokenWhileDisabled(USBD_HandleTypeDef *pdev)
{
  PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
  USB_OTG_GlobalTypeDef *USBx = pcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  USBx_DEVICE->DOEPMSK |= USB_OTG_DOEPMSK_OTEPDM;
}

static void USBD_DisableOutTokenWhileDisabled(USBD_HandleTypeDef *pdev)
{
  // Disable interrupt when not needed as it will cause many CDC interrupts
  bool is_interrupt_needed = false;

  for (size_t i = 0; i < AUDIO_OUT_NUMBER; i++)
  {
    if (usb_audio_endpoint_out_data[i].waiting_start)
    {
      is_interrupt_needed = true;
      break;
    }
  }

  // Interrupt is still needed
  if (is_interrupt_needed)
    return;

  PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
  USB_OTG_GlobalTypeDef *USBx = pcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  USBx_DEVICE->DOEPMSK &= ~USB_OTG_DOEPMSK_OTEPDM;
}

/**
  * @brief  USBD_AUDIO_Setup
  *         Handle the AUDIO specific requests
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
static uint8_t USBD_AUDIO_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
  USBD_AUDIO_HandleTypeDef *haudio;
  uint16_t len;
  uint8_t *pbuf;
  uint16_t status_info = 0U;
  USBD_StatusTypeDef ret = USBD_OK;

  haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataCmsit[pdev->classId];

  if (haudio == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  switch (req->bmRequest & USB_REQ_TYPE_MASK)
  {
    case USB_REQ_TYPE_CLASS:
      switch (req->bRequest)
      {
        case AUDIO_REQ_GET_CUR:
        case AUDIO_REQ_GET_MIN:
        case AUDIO_REQ_GET_MAX:
        case AUDIO_REQ_GET_RES:
          AUDIO_REQ_GetControl(pdev, req);
          break;

        case AUDIO_REQ_SET_CUR:
          AUDIO_REQ_SetCmd(pdev, req);
          break;


        case AUDIO_REQ_SET_MIN:
        case AUDIO_REQ_SET_MAX:
        case AUDIO_REQ_SET_RES:
          AUDIO_REQ_SetCmd(pdev, req);
          break;

        case AUDIO_REQ_GET_STAT:
          USBD_CtlSendData(pdev, haudio->control_tx_data, 0);
          break;

        default:
          USBD_CtlError(pdev, req);
          ret = USBD_FAIL;
          break;
      }
      break;

    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest)
      {
        case USB_REQ_GET_STATUS:
          if (pdev->dev_state == USBD_STATE_CONFIGURED)
          {
            (void)USBD_CtlSendData(pdev, (uint8_t *)&status_info, 2U);
          }
          else
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_GET_DESCRIPTOR:
          if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
          {
            pbuf = (uint8_t *)USBD_AUDIO_GetAudioHeaderDesc(pdev->pConfDesc);
            if (pbuf != NULL)
            {
              len = MIN(USB_AUDIO_DESC_SIZ, req->wLength);
              (void)USBD_CtlSendData(pdev, pbuf, len);
            }
            else
            {
              USBD_CtlError(pdev, req);
              ret = USBD_FAIL;
            }
          }
          break;

        case USB_REQ_GET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED)
          {
            USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromInterface(haudio, req->wIndex);
            if (data == NULL)
            {
              USBD_CtlError(pdev, req);
              ret = USBD_FAIL;
            }
            else
            {
              (void)USBD_CtlSendData(pdev, (uint8_t *)&data->current_alternate, 1U);
            }
          }
          else
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_SET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED)
          {
            USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromInterface(haudio, req->wIndex);
            if (data == NULL)
            {
              USBD_CtlError(pdev, req);
              ret = USBD_FAIL;
            }
            else
            {
              if (req->wValue == 1 && data->current_alternate == 0)
              {
                if (data->is_in)
                {
                  data->next_target_frame = -1;
                }
                else
                {
                  // ISO Out endpoint activated, we need to know which frame number the USB Host will use
                  // for these ISO Out transfers.
                  // For this, enable OutTokenWhileDisabled interrupt and wait for it
                  // before scheduling ISO Out transfers.
                  // For the feedback ISO In endpoint, we can't do that and instead will try until we get it
                  // using successive ISO In Incomplete interrupt.
                  data->next_target_frame = -1;
                  data->next_target_frame_feedback = -1;
                  GLITCH_DETECTION_set_USB_out_feedback_state(data->index, false);
                  USBD_EnableOutTokenWhileDisabled(pdev);
                }
                // We will start many ISO IN transfert with Incomplete IRQ at each micro frame
                // leading to higher CPU usage, reset CPU frequency to max
                DAMC_resetFrequencyToMaxPerformance();
              }
              data->current_alternate = req->wValue;
              if (data->current_alternate)
              {
                // Start of audio stream, we wait actual ISO transfer
                // before enabling glitch detection.
                data->waiting_start = 1;
                data->complete_iso = 0;
              }
              else
              {
                // End of audio stream, if we were waiting for stream start,
                // we need to cancel it and disable OutTokenWhileDisabled if not needed.
                data->waiting_start = 0;
                USBD_DisableOutTokenWhileDisabled(pdev);
                // Mark the stream as out of sync
                GLITCH_DETECTION_set_USB_out_feedback_state(data->index, false);
              }
              data->waiting_stop = 0;

