amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
              if (data->is_in)
              {
                if (req->wValue)
                  USBD_AUDIO_trace(data, "Set Alternate IN 1");
                else
                  USBD_AUDIO_trace(data, "Set Alternate IN 0");
              }
              else
              {
                if (req->wValue)
                  USBD_AUDIO_trace(data, "Set Alternate OUT 1");
                else
                  USBD_AUDIO_trace(data, "Set Alternate OUT 0");
              }
            }
          }
          else
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_CLEAR_FEATURE:
          break;

        default:
          USBD_CtlError(pdev, req);
          ret = USBD_FAIL;
          break;
      }
      break;
    default:
      USBD_CtlError(pdev, req);
      ret = USBD_FAIL;
      break;
  }

  return (uint8_t)ret;
}


/**
  * @brief  USBD_AUDIO_EP0_RxReady
  *         handle EP0 Rx Ready event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_AUDIO_EP0_RxReady(USBD_HandleTypeDef *pdev)
{
  USBD_AUDIO_HandleTypeDef *haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataCmsit[pdev->classId];
  uint8_t unit_id = HIBYTE(haudio->control_req.wIndex);

  if (haudio->control_req.bRequest == AUDIO_REQ_SET_CUR)
  {
    /* In this driver, to simplify code, only SET_CUR request is managed */
    uint16_t value = 0;

    memcpy(&value, haudio->control_tx_data, MIN(haudio->control_req.wLength, sizeof(value)));

    DAMC_setControlFromUSB(unit_id, HIBYTE(haudio->control_req.wValue), LOBYTE(haudio->control_req.wValue), haudio->control_req.bRequest, value);

    haudio->control_req = (USBD_SetupReqTypedef){0};
  }

  return (uint8_t)USBD_OK;
}
/**
  * @brief  USBD_AUDIO_EP0_TxReady
  *         handle EP0 TRx Ready event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_AUDIO_EP0_TxReady(USBD_HandleTypeDef *pdev)
{
  UNUSED(pdev);

  /* Only OUT control data are processed */
  return (uint8_t)USBD_OK;
}
/**
  * @brief  USBD_AUDIO_SOF
  *         handle SOF event
  * @param  pdev: device instance
  * @retval status
  */
__attribute__((used)) uint32_t missed_sofs;
__attribute__((used)) uint32_t last_frame_number_gap;
__attribute__((used)) uint32_t duplicate_sofs;
__attribute__((used)) uint32_t long_sofs;
static uint8_t USBD_AUDIO_SOF(USBD_HandleTypeDef *pdev)
{
  PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
  USB_OTG_GlobalTypeDef *USBx = pcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t frameNumber = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF_Msk) >> USB_OTG_DSTS_FNSOF_Pos;

  static uint32_t previous_framenumber;

  if (previous_framenumber == frameNumber)
  {
    duplicate_sofs++;
    return USBD_OK;
  }
  if (((previous_framenumber + 1) & 0x3fff) != frameNumber)
  {
    missed_sofs++;
    last_frame_number_gap = (frameNumber + 0x4000 - previous_framenumber) & 0x3fff;
  }

  previous_framenumber = frameNumber;

  if ((frameNumber % 8) == 0)
  {
    usb_new_frame_flag = 1;
  }

  // Start ISO transfers when needed according to the frame number.
  // All transfers are started here.

  for (size_t i = 0; i < AUDIO_IN_NUMBER; i++)
  {
    USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_in_data[i];

    if (data->current_alternate)
    {
      if (data->next_target_frame == -1 && data->transfer_in_progress == 0)
      {
        // Transfer ZLP at each microframe to detect the first frame number of the ISO period
        data->transfer_in_progress = 1;
        USBD_LL_Transmit(pdev, data->endpoint, zero_data, 0);
      }
      else if (data->next_target_frame == frameNumber)
      {
        while (data->transfer_in_progress > 0)
          ;
        data->transfer_in_progress = 1;
        USBD_AUDIO_Buffer *buffer = &data->buffer;
        USBD_AUDIO_trace(data, "USBD_LL_Transmit");

        uint32_t size_to_read = DAMC_getUSBInSizeValue(DUB_In + i);
        data->accumulated_transmit_error += size_to_read;
        size_to_read = data->accumulated_transmit_error / 65536;
        if (size_to_read > sizeof(buffer->buffer) / 4)
        {
          size_to_read = sizeof(buffer->buffer) / 4;
        }
        data->accumulated_transmit_error -= size_to_read * 65536;

        buffer->size = DAMC_readAudioSample(DUB_In, buffer->buffer, size_to_read) * 4;

        if (buffer->size > 0)
        {
          USBD_LL_Transmit(pdev, data->endpoint, buffer->buffer, buffer->size);
          buffer->size = 0U;
        }
        else
        {
          USBD_LL_Transmit(pdev, data->endpoint, zero_data, data->nominal_packet_size);
        }
      }
    }
  }

  for (size_t i = 0; i < AUDIO_OUT_NUMBER; i++)
  {
    USBD_AUDIO_LoopbackDataTypeDef *data = &usb_audio_endpoint_out_data[i];

    if (data->current_alternate)
    {
      if (data->transfer_in_progress == 0 && data->next_target_frame == frameNumber)
      {
        while (data->transfer_in_progress > 0)
          ;
        data->transfer_in_progress = 1;
        data->feedback = DAMC_getUSBFeedbackValue(i);
        USBD_AUDIO_Buffer *buffer = &data->buffer;
        USBD_AUDIO_trace(data, "USBD_LL_PrepareReceive");
        USBD_LL_PrepareReceive(pdev, data->endpoint, buffer->buffer, data->max_packet_size);
      }
      if ((data->next_target_frame_feedback == -1 && !data->feedback_transfer_in_progress) || data->next_target_frame_feedback == frameNumber)
      {
        data->buffer_feedback[0] = data->feedback & 0xFF;
        data->buffer_feedback[1] = (data->feedback >> 8) & 0xFF;
        data->buffer_feedback[2] = (data->feedback >> 16) & 0xFF;
        data->buffer_feedback[3] = (data->feedback >> 24) & 0xFF;
        data->feedback_transfer_in_progress = 1;
        USBD_LL_Transmit(pdev, data->endpoint_feedback, data->buffer_feedback, sizeof(data->buffer_feedback));
      }
    }
  }

  // If an USB Interrupt is not in progress and a USB control value changed, send a USB interrupt to the USB Host
  uint16_t unit_id_change_bitmask = usb_audio_notify_unit_id_change;
  if (!usb_audio_notify_in_progress_data && unit_id_change_bitmask)
  {
    uint8_t unit_id = 31 - __builtin_clz(unit_id_change_bitmask);
    usb_audio_notify_unit_id_change &= ~(1 << unit_id);
    // bStatusType (lower byte) = bit7 (interrupt pending) and bit0-3 == 0 (audio control interface)
    usb_audio_notify_in_progress_data = (unit_id << 8) | (1 << 7) | (0 << 0);
    USBD_LL_Transmit(pdev, AUDIO_INTERRUPT_EP, (uint8_t *)&usb_audio_notify_in_progress_data, sizeof(usb_audio_notify_in_progress_data));
  }

