amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
  uint32_t frameNumber2 = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF_Msk) >> USB_OTG_DSTS_FNSOF_Pos;
  if (frameNumber2 != frameNumber)
  {
    long_sofs++;
    last_frame_number_gap = (frameNumber + 0x4000 - frameNumber2) & 0x3fff;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_IsoINIncomplete
  *         handle data ISO IN Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_IsoINIncomplete(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  uint8_t is_feedback = USBD_AUDIO_isFeedbackEndpoint(epnum);
  USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, !is_feedback);

  if (data == NULL)
  {
    return USBD_OK;
  }

  data->incomplete_iso++;

  // The USB Host did not emitted a ISO In token for the frame we scheduled it,
  // either the USB Host is not reading the ISO In endpoint or
  // it is reading on a different frame number.
  // Schedule a transfer at a different frame number to try to sync with the USB Host.

  if (is_feedback)
  {
    data->feedback_transfer_in_progress = 0;
    if (data->current_alternate)
    {
      if (data->next_target_frame_feedback != -1)
      {
        // First time we get incomplete, reset CPU frequency to max in case we get many Incomplete IRQ
        DAMC_resetFrequencyToMaxPerformance();
      }

      data->next_target_frame_feedback = -1;  // (pcd->FrameNumber + 126) & 0x3FFF;

      // Prepare for next SOF with ZLP to check for IN token
      data->feedback_transfer_in_progress = 1;
      USBD_LL_Transmit(pdev, data->endpoint_feedback, data->buffer_feedback, 0);

      if (!data->waiting_stop)
      {
        // The feedback transfer was lost and we are not stopping, the host is not reading the feedback clock anymore
        GLITCH_DETECTION_set_USB_out_feedback_state(data->index, false);
      }
    }
  }
  else
  {
    USBD_AUDIO_trace(data, "IsoINIncomplete (usbd_audio.c)");
    data->transfer_in_progress = 0;

    if (data->current_alternate)
    {
      if (data->next_target_frame != -1)
      {
        // First time we get incomplete, reset CPU frequency to max in case we get many Incomplete IRQ
        DAMC_resetFrequencyToMaxPerformance();
      }
      data->next_target_frame = -1;  // (pcd->FrameNumber + 6) & 0x3FFF;

      // Prepare for next SOF with ZLP to check for IN token
      data->transfer_in_progress = 1;
      USBD_LL_Transmit(pdev, data->endpoint, zero_data, 0);

      if (!data->waiting_start)
      {
        // We are not waiting for a start, so we got ISO transfer previously but not anymore.
        // Assume the stream is stopping.
        // If it was a glitch (lost ISO transfer) and we will get ISO transfer later, DataIn will handle that case
        // and notify the glitch.
        data->waiting_stop = 1;

        // We are going back to searching the first IN token.
        // So we are also waiting for a possible start too (along with a possible stop)
        // If it was just a glitch, we will act as if a new stream is started.
        data->waiting_start = 1;
      }
    }
  }

  return (uint8_t)USBD_OK;
}
/**
  * @brief  USBD_AUDIO_IsoOutIncomplete
  *         handle data ISO OUT Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
uint32_t iso_incomplete_gintsts;
static uint8_t USBD_AUDIO_IsoOutIncomplete(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, 0);

  if (data == NULL)
  {
    return USBD_OK;
  }

  if (epnum == 5 && iso_incomplete_gintsts == 0)
  {
    USB_OTG_GlobalTypeDef *USBx = hpcd_USB_OTG_HS.Instance;
    iso_incomplete_gintsts = USBx->GINTSTS;
  }

  USBD_AUDIO_trace(data, "IsoOutIncomplete (usbd_audio.c)");
  data->transfer_in_progress = 0;
  data->incomplete_iso++;


  if (data->current_alternate && !data->waiting_start)
  {
    // We are not waiting for a start, so we got ISO transfer previously but not anymore.
    // Assume the stream is stopping.
    // If it was a glitch (lost ISO transfer) and we will get ISO transfer later, DataOut will handle that case
    // and notify the glitch.
    data->waiting_stop = 1;

    // Don't update data->next_target_frame to keep the current running state
    // but reenable OutTokenWhileDisabled in case we got desync.
    // So we are also waiting for a possible start too (along with a possible stop)
    // If it was just a glitch, OutTokenWhileDisabled will be disabled again in DataOut.
    data->waiting_start = 1;
    USBD_EnableOutTokenWhileDisabled(pdev);
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_OutTokenWhileDisabled
  *         handle OUT token while endpoint disabled event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_OutTokenWhileDisabled(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, 0);

  if (data == NULL)
  {
    return USBD_OK;
  }

  USBD_AUDIO_trace(data, "OutTokenWhileDisabled");

#ifdef USB_AUDIO_ENABLE_HISTORY
  if (data->history_save_disable == 1)
  {
    uint8_t history_index = data->history_index + 1;
    memcpy(data->history_on_isoincomplete, &data->history[history_index], (256 - history_index) * sizeof(struct history_data));
    memcpy(&data->history_on_isoincomplete[256 - history_index], &data->history[0], history_index * sizeof(struct history_data));
  }
  if (data->history_save_disable > 0)
  {
    data->history_save_disable--;
  }
#endif

  // We got a OutTokenWhileDisabled interrupt, this means the USB Host
  // tried to send data using a ISO Out token.
  // Schedule a ISO Out receive transfer for the next period.
  // If that transfer succeed, OutTokenWhileDisabled interrupt will be disabled as not needed anymore.
  if (data->current_alternate && data->transfer_in_progress == 0)
  {
    PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
    data->next_target_frame = (pcd->FrameNumber + 7) & 0x3FFF;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_InTokenWhileTXEmptyCallback
  *         handle OUT token while endpoint disabled event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_InTokenWhileTXEmptyCallback(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_AUDIO_trace(data, "USBD_AUDIO_InTokenWhileTXEmptyCallback");
  if (epnum == 3)
    return USBD_OK;

