amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
  uint8_t is_feedback = USBD_AUDIO_isFeedbackEndpoint(epnum);
  if (!is_feedback)
  {
    return USBD_OK;
  }

  USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, 0);
  if (data == NULL)
  {
    return USBD_OK;
  }

  // We got a USBD_AUDIO_InTokenWhileTXEmptyCallback interrupt, this means the USB Host
  // tried to receive data using a In token.
  // Schedule a ISO In transmit transfer for the next period.
  // If that transfer succeed, USBD_AUDIO_InTokenWhileTXEmptyCallback interrupt will be disabled as not needed anymore.
  if (data->current_alternate)
  {
    PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
    data->next_target_frame_feedback = (pcd->FrameNumber + 127) & 0x3FFF;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_DataIn
  *         handle data IN Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */

// https://elixir.bootlin.com/linux/v6.3.1/source/drivers/usb/dwc2/gadget.c#L2953

static uint8_t USBD_AUDIO_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  if (epnum == (AUDIO_INTERRUPT_EP & 0x7F))
  {
    // USB Interrupt completed, reset to 0 so we are
    // ready for a new interrupt transfer.
    usb_audio_notify_in_progress_data = 0;
  }
  else
  {
    uint8_t is_feedback = USBD_AUDIO_isFeedbackEndpoint(epnum);
    USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, !is_feedback);

    if (data == NULL)
    {
      return USBD_OK;
    }

    if (is_feedback)
    {
      data->feedback_transfer_in_progress = 0;
      if (data->current_alternate == 0)
      {
        return USBD_OK;
      }

      // Schedule the next feedback transfer
      // Note: next_target_frame_feedback is -1 when we get the first ISO In token
      PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
      data->next_target_frame_feedback = (pcd->FrameNumber + 127) & 0x3FFF;

      // Mark audio out sync as working as the host read our feedback clock data
      GLITCH_DETECTION_set_USB_out_feedback_state(data->index, true);
    }
    else
    {
      // Used to ensure we never start a transfer while one is already scheduled.
      data->transfer_in_progress = 0;

      // May never happen ? ISO transfer should always be stopped
      // before the USB bandwidth is unallocated by changing to alternate 0,
      // but in case we have a somewhat cancelled transfer, ignore it
      if (data->current_alternate == 0)
      {
        return USBD_OK;
      }

      // Count number of completed ISO transfer for statistics
      data->complete_iso++;

      // Schedule next ISO transfer frame number
      PCD_HandleTypeDef *pcd = (PCD_HandleTypeDef *)pdev->pData;
      data->next_target_frame = (pcd->FrameNumber + 7) & 0x3FFF;

      // Stream just started, this is the first ISO transfer done.
      // This will enable glitch detection.
      if (data->waiting_start)
      {
        data->waiting_start = 0;
        // Reset audio buffer
        DAMC_resetAudioBuffer(DUB_In);
      }

      // If we lost a ISO transfer previously and got DataIn now,
      // a ISO transfer got lost and the stream is continuing instead of stopping.
      if (data->waiting_stop)
      {
        data->waiting_stop = 0;
        GLITCH_DETECTION_increment_counter(GT_UsbIsochronousTransferLost);
      }

      USBD_AUDIO_trace(data, "DataIn");
    }
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_AUDIO_DataOut
  *         handle data OUT Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  USBD_AUDIO_HandleTypeDef *haudio;

#ifdef USE_USBD_COMPOSITE
  /* Get the Endpoints addresses allocated for this class instance */
  AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t)pdev->classId);
#endif /* USE_USBD_COMPOSITE */

  haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataCmsit[pdev->classId];
  USBD_AUDIO_LoopbackDataTypeDef *data = USBD_AUDIO_getDataFromEndpoint(epnum, 0);

  if (haudio == NULL || data == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  if (epnum >= AUDIO_OUT_EP)
  {
    USBD_AUDIO_Buffer *buffer = &data->buffer;

    USBD_AUDIO_trace(data, "DataOut");
    data->transfer_in_progress = 0;
    data->complete_iso++;

    // Assume we are fully started at correct speed after 2 feedbacks,
    // which is 16*2 = 32 data ISO xfer.
    // We are not counting feedback transfer as they might not be done by the USB Host (Windows).
    // This additional wait before assuming the transfer is started is needed
    // to avoid the case where a USB stream just started, but the USB Host is not
    // sending enough data as it didn't received enough feedback yet.
    // In this case, there might be USB buffer underflow which are expected and should not
    // be notified to the user.
    //
    // We also get waiting_start == 1 in case of a USB ISO Out desync where
    // OutTokenWhileDisabled interrupt got enabled again in ISOOutIncomplete.
    if (data->complete_iso >= 32 && data->waiting_start)
    {
      data->waiting_start = 0;
      // OTEPDM Interrupt is not needed anymore
      USBD_DisableOutTokenWhileDisabled(pdev);
    }

    /* Get received data packet length */
    buffer->size = (uint16_t)USBD_LL_GetRxDataSize(pdev, epnum);

    // If we lost a ISO transfer previous and got DataOut now,
    // a ISO transfer got lost and the stream is continuing instead of stopping.
    if (data->waiting_stop)
    {
      data->waiting_stop = 0;
      GLITCH_DETECTION_increment_counter(GT_UsbIsochronousTransferLost);
    }

    int32_t index = ((epnum & 0x0F) - (AUDIO_OUT_EP & 0x0F)) / 2;
    uint32_t nframes = buffer->size / 4;
    size_t writtenSize = DAMC_writeAudioSample(index, buffer->buffer, nframes);
    if (writtenSize != nframes)
    {
      GLITCH_DETECTION_increment_counter(GT_UsbOutOverrun);
    }

    // Schedule the next ISO transfer
    data->next_target_frame = (data->next_target_frame + 8) & 0x3FFF;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  AUDIO_Req_GetCurrent
  *         Handles the GET_CUR Audio control request.
  * @param  pdev: device instance
  * @param  req: setup class request
  * @retval status
  */
static void AUDIO_REQ_GetControl(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
  USBD_AUDIO_HandleTypeDef *haudio;
  haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataCmsit[pdev->classId];

  if (haudio == NULL)
  {
    return;
  }

