amurzeau/damc_stm32f723disco/src/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
  (void)USBD_memset(haudio->control_tx_data, 0, USB_MAX_EP0_SIZE);

  uint16_t value = DAMC_getControlFromUSB(HIBYTE(req->wIndex), HIBYTE(req->wValue), LOBYTE(req->wValue), req->bRequest);

  memcpy(haudio->control_tx_data, &value, sizeof(value));

  /* Send the current mute state */
  (void)USBD_CtlSendData(pdev, haudio->control_tx_data, MIN(req->wLength, USB_MAX_EP0_SIZE));
}

/**
  * @brief  AUDIO_Req_SetCurrent
  *         Handles the SET_CUR Audio control request.
  * @param  pdev: device instance
  * @param  req: setup class request
  * @retval status
  */
static void AUDIO_REQ_SetCmd(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req)
{
  USBD_AUDIO_HandleTypeDef *haudio;
  haudio = (USBD_AUDIO_HandleTypeDef *)pdev->pClassDataCmsit[pdev->classId];

  if (haudio == NULL)
  {
    return;
  }

  if (req->wLength != 0U)
  {
    haudio->ep0_data_endpoint = USBD_AUDIO_getDataFromUnitId(haudio, HIBYTE(req->wIndex));
    haudio->control_req = *req;

    haudio->control_req.wLength = MIN(req->wLength, USB_MAX_EP0_SIZE);
    /* Prepare the reception of the buffer over EP0 */
    (void)USBD_CtlPrepareRx(pdev, haudio->control_tx_data, haudio->control_req.wLength);
  }
}


#ifdef USE_USBD_COMPOSITE
/**
  * @brief  USBD_AUDIO_GetEpPcktSze
  * @param  pdev: device instance (reserved for future use)
  * @param  If: Interface number (reserved for future use)
  * @param  Ep: Endpoint number (reserved for future use)
  * @retval status
  */
uint32_t USBD_AUDIO_GetEpPcktSze(USBD_HandleTypeDef *pdev, uint8_t If, uint8_t Ep)
{
  uint32_t mps;

  UNUSED(pdev);
  UNUSED(If);
  UNUSED(Ep);

  mps = AUDIO_PACKET_SZE_WORD;

  /* Return the wMaxPacketSize value in Bytes (Freq(Samples)*2(Stereo)*2(HalfWord)) */
  return mps;
}
#endif /* USE_USBD_COMPOSITE */

/**
  * @brief  USBD_AUDIO_GetAudioHeaderDesc
  *         This function return the Audio descriptor
  * @param  pdev: device instance
  * @param  pConfDesc:  pointer to Bos descriptor
  * @retval pointer to the Audio AC Header descriptor
  */
static void *USBD_AUDIO_GetAudioHeaderDesc(uint8_t *pConfDesc)
{
  USBD_ConfigDescTypeDef *desc = (USBD_ConfigDescTypeDef *)(void *)pConfDesc;
  USBD_DescHeaderTypeDef *pdesc = (USBD_DescHeaderTypeDef *)(void *)pConfDesc;
  uint8_t *pAudioDesc = NULL;
  uint16_t ptr;

  if (desc->wTotalLength > desc->bLength)
  {
    ptr = desc->bLength;

    while (ptr < desc->wTotalLength)
    {
      pdesc = USBD_GetNextDesc((uint8_t *)pdesc, &ptr);
      if ((pdesc->bDescriptorType == AUDIO_INTERFACE_DESCRIPTOR_TYPE) && (pdesc->bDescriptorSubType == AUDIO_CONTROL_HEADER))
      {
        pAudioDesc = (uint8_t *)pdesc;
        break;
      }
    }
  }
  return pAudioDesc;
}

void USBD_AUDIO_NotifyUnitIdChanged(uint8_t unit_id)
{
  usb_audio_notify_unit_id_change |= 1 << unit_id;
}

// Return true when the audio stream is started and stable and we are
// ready to detect glitches.
uint32_t USBD_AUDIO_IsEndpointEnabled(int is_in, int index)
{
  USBD_AUDIO_LoopbackDataTypeDef *data;
  if (is_in)
  {
    data = &usb_audio_endpoint_in_data[index];
  }
  else
  {
    data = &usb_audio_endpoint_out_data[index];
  }

  return data->current_alternate && !data->waiting_start && !data->waiting_stop;
}
/**
  * @}
  */


/**
  * @}
  */


/**
  * @}
  */
